testCases/YabukiNakabeppu_ML/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
application     lubricationMicrolayerModelNucleateBoilingFlow;

startFrom       latestTime;

startTime       0;

stopAt          writeNow; //writeNow; //endTime;

endTime         0.03;

deltaT          1e-6;

writeControl    adjustable;

writeInterval   5e-4;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;

maxCo           0.2;

maxAlphaCo      0.1;

maxCapillaryNum 1e8;

// Maximum diffusion number
maxDi           10.0;

maxDeltaT       1e-3;

adjustTimeStep  no;

functions
{

}


// ************************************************************************* //
