testCases/YabukiNakabeppu_ML/0.orig/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

#include "../../constant/runParams"


internalField  uniform $Tbulk;

boundaryField
{
    right
    {
        type            calculated;
        value           uniform $Tbulk;
    }
    
    top
    {
        type            calculated;
        value           uniform $Tbulk;
    }
    
    fluid_to_solid
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
    	value           uniform $Tbulk;
        Tnbr            T;
        kappaMethod     fluidThermo;
        kappaName       none;
    }
    
    axis
    {
    	type		empty;
    }
    
    front
    {
        type            wedge;
    }
    
    back
    {
        type            wedge;
    }
    
}

/*
boundaryField
{
    right
    {
        type 		fixedValue;
        value 		uniform $Tbulk;
    }

    top
    {
        type 		fixedValue;
        value 		uniform $Tbulk;
    }

    fluid_to_solid
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
    	value           uniform $Tbulk;
        Tnbr            T;
        kappaMethod     fluidThermo;
        kappaName       none;
    }
    
    axis
    {
    	type            empty;
    }
    
    front
    {
        type            wedge;
    }
    
    back
    {
        type            wedge;
    }
}
*/
// ************************************************************************* //

